# Análise de dados com Python e Pandas
## Aula 3: Trabalhando com Planilhas do Excel

In [ ]:
# Importa a biblioteca Pandas
import pandas as pd

In [ ]:
# Lê os arquivos
df1 = pd.read_excel("/Aracaju.xlsx")
df2 = pd.read_excel("/Fortaleza.xlsx")
df3 = pd.read_excel("/Natal.xlsx")
df4 = pd.read_excel("/Recife.xlsx")
df5 = pd.read_excel("/Salvador.xlsx")

In [ ]:
# Concatena todos os arquivos
df = pd.concat([df1,df2,df3,df4,df5])

In [ ]:
# Exibe as 5 primeiras linhas
df.head()

    Cidade       Data  Vendas  LojaID  Qtde
0  Aracaju 2018-01-01  142.00    1520     1
1  Aracaju 2018-01-01   14.21    1522     6
2  Aracaju 2018-01-01   71.55    1520     1
3  Aracaju 2018-01-01    3.01    1521     7
4  Aracaju 2018-01-01   24.51    1522     8

In [ ]:
# Exibe as 5 últimas linhas
df.tail()

       Cidade       Data  Vendas  LojaID  Qtde
235  Salvador 2019-01-03   41.84    1034     1
236  Salvador 2019-01-03  126.29    1035     3
237  Salvador 2019-01-03   38.06    1036     3
238  Salvador 2019-01-03  139.64    1035     1
239  Salvador 2019-01-03  161.41    1037     3

In [ ]:
# Verifica os tipos de dados do DataFrame
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID             int64
Qtde               int64
dtype: object

In [ ]:
# Altera o tipo de dado da coluna LojaID
df['LojaID'] = df['LojaID'].astype('object')
df.dtypes

Cidade            object
Data      datetime64[ns]
Vendas           float64
LojaID            object
Qtde               int64
dtype: object

### Tratando valores faltantes

In [ ]:
# Consulta linhas com valores faltantes
df.isnull().sum()

Cidade    0
Data      0
Vendas    0
LojaID    0
Qtde      0
dtype: int64

In [ ]:
# Substitui os valores nulos pela média
df['Vendas'].fillna(df['Vendas'].mean(), inplace=True)

In [ ]:
# Exibe uma umostra dos dados
df.sample(15)

        Cidade       Data  Vendas LojaID  Qtde
28    Salvador 2019-01-01  162.34   1035     2
68      Recife 2019-01-01  175.45    980     3
57     Aracaju 2018-01-01   23.49   1520     7
87     Aracaju 2018-01-01  116.71   1520     4
225      Natal 2019-01-02   36.23   1035     1
10       Natal 2018-10-27  828.00    852     4
107  Fortaleza 2019-01-01   21.90   1004     6
64     Aracaju 2018-01-01   21.00   1523     5
2     Salvador 2019-02-10  173.59   1035     3
37   Fortaleza 2019-01-01   35.86   1002     6
102    Aracaju 2018-01-01    7.29   1523     1
106     Recife 2019-01-01   30.46    982     3
178   Salvador 2019-01-02   39.28   1037     3
91   Fortaleza 2019-01-01   37.49   1002     1
18   Fortaleza 2019-01-01   38.31   1002     3

In [ ]:
# Substitui os valores nulos por 0
df['Vendas'].fillna(0, inplace=True)

In [ ]:
# Remove as linhas com valores nulos
df.dropna(inplace=True)

In [ ]:
# Remove as linhas com valores nulos com base em 1 coluna
df.dropna(subset=['Vendas'], inplace=True)

In [ ]:
# Remove as linhas que estejam com valores faltantes em todas as colunas
df.dropna(how='all', inplace=True)

### Criando novas colunas

In [ ]:
# Cria a coluna Receita
df["Receita"] = df["Vendas"].mul(df["Qtde"])
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita
0  Aracaju 2018-01-01  142.00   1520     1   142.00
1  Aracaju 2018-01-01   14.21   1522     6    85.26
2  Aracaju 2018-01-01   71.55   1520     1    71.55
3  Aracaju 2018-01-01    3.01   1521     7    21.07
4  Aracaju 2018-01-01   24.51   1522     8   196.08

In [ ]:
df["Receita/Venda"] = df["Receita"] / df["Vendas"]
df.head()

    Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
0  Aracaju 2018-01-01  142.00   1520     1   142.00            1.0
1  Aracaju 2018-01-01   14.21   1522     6    85.26            6.0
2  Aracaju 2018-01-01   71.55   1520     1    71.55            1.0
3  Aracaju 2018-01-01    3.01   1521     7    21.07            7.0
4  Aracaju 2018-01-01   24.51   1522     8   196.08            8.0

In [ ]:
# Retorna a maior receita
df["Receita"].max()

3544.0

In [ ]:
# Retorna a menor receita
df["Receita"].min()

3.34

In [ ]:
# Retorna as 'n' maiores receitas
df.nlargest(3, "Receita")

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
7   Natal 2019-03-18   886.0    853     4   3544.0            4.0
51  Natal 2018-01-21   859.0    852     4   3436.0            4.0
55  Natal 2019-01-08   859.0    854     4   3436.0            4.0

In [ ]:
# Retorna as 'n' menores receitas
df.nsmallest(3, "Receita")

      Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
118  Aracaju 2018-01-01    3.34   1522     1     3.34            1.0
65    Recife 2019-01-01    4.01    981     1     4.01            1.0
92     Natal 2019-01-02    4.57   1035     1     4.57            1.0

In [ ]:
# Agrupamento por cidade
df.groupby("Cidade")["Receita"].sum()

Cidade
Aracaju       48748.25
Fortaleza     37913.97
Natal        167227.52
Recife        51936.51
Salvador      40596.73
Name: Receita, dtype: float64

In [ ]:
# Exibe o conjunto de dados ordenado pela receita
df.sort_values("Receita", ascending=False).head(10)

   Cidade       Data  Vendas LojaID  Qtde  Receita  Receita/Venda
7   Natal 2019-03-18   886.0    853     4   3544.0            4.0
55  Natal 2019-01-08   859.0    854     4   3436.0            4.0
51  Natal 2018-01-21   859.0    852     4   3436.0            4.0
30  Natal 2018-10-02   856.0    853     4   3424.0            4.0
41  Natal 2018-05-20   835.0    852     4   3340.0            4.0
38  Natal 2018-02-25   828.0    852     4   3312.0            4.0
10  Natal 2018-10-27   828.0    852     4   3312.0            4.0
69  Natal 2019-03-24   817.0    852     4   3268.0            4.0
62  Natal 2018-02-10   793.0    854     4   3172.0            4.0
52  Natal 2018-04-27   778.0    854     4   3112.0            4.0

FIM